tutorials/multiphase/reactingMultiphaseEulerFoam/laminar/mixingFluidizedBed/biomassPyrolysisReactor3D/0.org/U.particles1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.particles1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type               fixedValue;
        value              uniform (0 0 0);
    }
    
    biomass_inlet
    {
        type                interstitialInletVelocity;//fixedValue;
        inletVelocity      uniform (0.00522 0 0);
        alpha              alpha.particles1;
        value               uniform (0.00522 0 0);

    }

    outlet
    {
        type               pressureInletOutletVelocity;
        phi                 phi.particles1;
        value               $internalField;
    }

    walls
    {
        type                     JohnsonJacksonParticleSlip;
        restitutionCoefficient   0.2;
        specularityCoefficient   0.1;
        muF                      0.25;
        sigma                    2;
        value                    uniform (0 0 0);
    }

    defaultFaces
    {
        type               empty;
    }
}

// ************************************************************************* //
